
# numbers = [100, 200, 300, 400, 500]
# for number in numbers:
#     print('число', number)
# print('Конец программы')

# numbers = [1, [2, 2.5], (3, '3')]

# result = 0
# for i in numbers:
#     if isinstance(i, (list, tuple)): # проверка на список и кортеж
#         for j in i:
#             if isinstance(j, (int, float)): # проверка на int и float
#                 result += j
#     elif isinstance(i, (int, float)): # проверка на int и float
#         result += i

# print('Сумма всех чисел =', result)

#==================================================================================================================
# # Создаем список городов
# cities = ['Москва', 'Париж', 'Лондон']

# # Выводим список городов до изменения
# print(f'Список городов до изменения: {cities}')

# # Вычисляем длину списка
# new_list_len = len(cities)

# # Итерируемся по списку городов
# for i in range(new_list_len):
#     # В каждой итерации в переменную i будет передаваться значение от 0 до 3 (длины списка)
#     # Получаем элемент списка по индексу i и записываем в него новое значение, равное 'Город: ' + значение_элемента
#     cities[i] = f'Город: {cities[i]}'


# # Выводим список городов после изменения
# print(f'Список городов после изменения: {cities}')

#==================================================================================================================
letters = ['a', 'b', 'c', 'd', 'e', 'f', ]

for letter in letters:
    letters.remove(letter)

print('Список после чистки: ', letters)